app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.get_ratings
    @saved_ratings = session["ratings"]

    if (!params["ratings"] and !(session["ratings"].any?))
     @chosen_ratings = @all_ratings
    elsif (!params["ratings"])
     @chosen_ratings =  Hash[@saved_ratings.map {|v| [v,1]}].keys
    else
     @chosen_ratings =  Hash(params["ratings"]).keys
    end


    if (params["title"])
      @movies = Movie.order(:title).where(:rating => @chosen_ratings)
      session["title"] = true
      params["release_date"] = false
      session["release_date"] = false
      session["ratings"] = @chosen_ratings
    elsif (params["release_date"])
      @movies = Movie.order(:release_date).where(:rating => @chosen_ratings)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'R')  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY "movies"."release_date" ASC

      session["title"] = false
      session["ratings"] = @chosen_ratings
    else
      @movies = Movie.where(:rating => @chosen_ratings)
---
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."PG-13" = '1' AND "rating"."R" = '1'